<!DOCTYPE html>
<html lang="ru">
    <head>
        <meta charset="UTF-8" />
        <meta name="viewport" content="width=device-width, initial-scale=1.0" />
        <meta http-equiv="X-UA-Compatible" content="ie=edge">
        <link rel="stylesheet" type="text/css" href="style.css">
        <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap@5.1.3/dist/css/bootstrap.min.css">
        <title>ItProgram - Посты</title>
    </head>
<body>
<?php require 'blocs/header.php';
?>
<img src="img/1-post.jpg" width="770px" height="270px"; style="margin-left: 500px;">
<h1 style="text-align: center;">Печатаем быстро: ТОП-3 сервиса для обучения</h1>
<p>typerun.top - это классический онлайн-сервис для обучения слепой печати. В нем нет нагроможденного функционала все просто и интуитивно понятно. Доступны тренировки разной сложности и на разных языках. Кроме того, есть словари для изучения английского, немецкого и других языков, в том числе языков программирования. Они также оформлены в виде тренировки скоростной печати.</p>
<p style="margin-bottom: 5px;">typingstudy.com - это целая образовательная система на более чем 100 языках, состоящая из 15 уроков. На сервисе есть проверка скорости печатания, статистика результатов и личный прогресс. Доступен без регистрации, но с ограниченным функционалом. Для облегчения процесса доступны 4 игры, в которых можно отработать навыки и потренировать внимательность.</p>
<p style="margin-bottom: 5px;">rapidtyping.com - направлен на обучение слепой печати. Доступны функции – групповая тренировка, статистика прогресса и результатов. Здесь также можно проверить свою скорость печати и выбрать курс по сложности согласно имеющимся навыкам.</p>
<img src="img/2-post.jpeg" width="770px" height="300px"; style="margin-left: 500px;">
<h1 style="text-align: center;">8 любопытных фактов о Java</h1>
<ul>
<li>В Соединенных Штатах на 90% компьютеров есть Java VM. И больше чем 95% корпоративных ПК используют данный язык.</li>
<li>На старте разработки Java проектировался для цифрового интерактивного TV. Однако сфера по уровню развития оказалась неготовой, чтобы применять его.</li>
<li>Создатель языка Джеймс Гослинг изначально назвал свой продукт в честь дерева, которое росло возле его офиса – Oak (Дуб). Потом имя изменили на Green, но только третий вариант стал окончательным – Java. Вдохновением для разработчика стал одноименный сорт кофе. Вот почему на официальной эмблеме красуется символ чашки с дымящимся напитком. Также распространена версия об аллюзии, т. е. намеке на кофейные аппараты, которые первыми среди прочих бытовых устройств начали программироваться на Java. В 2010 году контроль за развитием языка перешёл к Oracle, поглотившей фирму Sun Microsystems.</li>
<li>В среднем заработная плата Java-программиста составляет около 84 тысяч долларов. Во всем мире насчитывается до 9 млн Java-разработчиков.</li>
<li>Портал Tiobe.com отдал Java II место в рейтинге популярности языков программирования, признав более востребованным только один язык – C.</li>
<li>Основная Java-технология – фреймворк автоматического тестирования программ JUnit – используется 8 из 10 программистами. Следующим по популярности является Jenkins: им пользуются 70% специалистов.</li>
<li>В последнем релизе эффективность и производительность среды были повышены за счет уменьшения числа стандартных вставок, улучшению коллекций и добавлению примечаний.</li>
<li>Дюка – символ языка Java – создал Джо Пэлрэнг. Впоследствии одной из работ аниматора стал популярный во всем мире мультфильм "Шрэк".</li>
</ul>
<img src="img/3-post.jpg" width="770px" height="270px"; style="margin-left: 500px;">
<h1 style="text-align: center;">Топ-11 лучших бэкенд-фреймворков для web-мастеров в 2022 году</h1>
<ul>
	<li>Java Spring Boot</li>
	<li>Django (Python)</li>
	<li>Express.js (JavaScript)</li>
	<li>ASP.NET core</li>
	<li>Laravel (PHP)</li>
	<li>Ruby on Rails (Ruby)</li>
	<li>Fiber Framework (Golang)</li>
	<li>Flask (Python)</li>
	<li>CakePHP (PHP)</li>
	<li>Flask (Python)</li>
	<li>Play (Scala)</li>
</ul>
<?php require 'blocs/footer.php';
?>
</body>